In [3]:
import pandas as pd

## 예제 2-12 데이터를 읽어오기

In [4]:
ct = pd.read_csv("../data/2017_college_tuition.csv",encoding='euc-kr')

In [5]:
ct.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [6]:
ct.tail()

         학교명 설립구분  평균등록금
191    호남대학교   사립   6482
192  호남신학대학교   사립   6438
193    호서대학교   사립   7695
194    호원대학교   사립   6929
195    홍익대학교   사립   8297

In [7]:
ct.shape

(196, 3)

In [8]:
ct.columns

Index(['학교명', '설립구분', '평균등록금'], dtype='object')

## 예제 2-13 대괄호를 이용한 일반 검색

In [9]:
ct_ser = ct['학교명']

In [10]:
ct_ser.head()

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

In [11]:
ct_ser[0]

'강릉원주대학교'

In [12]:
ct_ser[1]

'강원대학교'

In [13]:
ct_ser[100]

'부산장신대학교'

In [14]:
ct_ser.__getitem__(100)

'부산장신대학교'

In [15]:
ct.__getitem__('학교명').head()

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

## 예제 2-14 대괄호를 이용한 슬라이스 검색

In [16]:
ct_ser[10:20]

10      금오공과대학교
11      대구교육대학교
12        목포대학교
13      목포해양대학교
14        부경대학교
15      부산교육대학교
16        부산대학교
17    서울과학기술대학교
18      서울교육대학교
19        서울대학교
Name: 학교명, dtype: object

In [17]:
ct_slice = ct[10:20]

In [18]:
ct_slice

          학교명 설립구분  평균등록금
10    금오공과대학교  국공립   3769
11    대구교육대학교  국공립   3604
12      목포대학교  국공립   3895
13    목포해양대학교  국공립   3424
14      부경대학교  국공립   4042
15    부산교육대학교  국공립   3024
16      부산대학교  국공립   4325
17  서울과학기술대학교  국공립   5405
18    서울교육대학교  국공립   3088
19      서울대학교  국공립   5962

In [19]:
ct_slice.head()

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042

In [20]:
ct_slice.shape

(10, 3)

In [21]:
# slice => [] 와 같은 효과

In [22]:
ct.__getitem__(slice(10,20)).head()

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042